# GetDuplicateTypeNamesHandler Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupLoadOptions..::..GetDuplicateTypeNamesHandler Method
GroupLoadOptions Class See Also
---
Returns current duplicate type names handler or nullNothingnullptra null reference (Nothing in Visual Basic) if none is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()
```

Visual Basic
---
```text
Public Function GetDuplicateTypeNamesHandler As IDuplicateTypeNamesHandler
```

Visual C++
---
```text
public:
IDuplicateTypeNamesHandler^ GetDuplicateTypeNamesHandler()
```

# See Also
GroupLoadOptions Class
Autodesk.Revit.DB Namespace